IRP/src/Documents/AdditionalRevenueAllocation/AdditionalRevenueAllocation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>AdditionalRevenueAllocation</name>
 <registerRecords>InformationRegister.T6020S_BatchKeysInfo</registerRecords>
 <registerRecords>AccumulationRegister.R6060T_CostOfGoodsSold</registerRecords>
 <registerRecords>AccumulationRegister.T1050T_AccountingQuantities</registerRecords>
 <registerRecords>InformationRegister.T6070S_BatchRevenueAllocationInfo</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R6020B_BatchBalance</registerRecords>
 <registerRecords>AccumulationRegister.R6080T_OtherPeriodsRevenues</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>AllocationMode</name>
  <type>
   <types>EnumRef.AllocationMode</types>
  </type>
 </attributes>
 <attributes>
  <name>AllocationMethod</name>
  <type>
   <types>EnumRef.AllocationMethod</types>
  </type>
 </attributes>
 <tabularSections>
  <name>RevenueList</name>
  <attributes>
   <name>RowID</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Basis</name>
   <type>
    <types>DocumentRef.SalesInvoice</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Currency</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>RevenueType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AllocationList</name>
  <attributes>
   <name>BasisRowID</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>RowID</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Document</name>
   <type>
    <types>DocumentRef.PurchaseInvoice</types>
   </type>
  </attributes>
  <attributes>
   <name>Store</name>
   <type>
    <types>CatalogRef.Stores</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>SerialLotNumber</name>
   <type>
    <types>CatalogRef.SerialLotNumbers</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>RevenueDocuments</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Document</name>
   <type>
    <types>DocumentRef.SalesInvoice</types>
   </type>
  </attributes>
  <attributes>
   <name>Currency</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AllocationDocuments</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Document</name>
   <type>
    <types>DocumentRef.PurchaseInvoice</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AllocationResult</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>RowID</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>BasisRowID</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>RevenueSalesInvoice</name>
   <type>
    <types>DocumentRef.SalesInvoice</types>
   </type>
  </attributes>
  <attributes>
   <name>RevenueItem</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>RevenueItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>SalesInvoice</name>
   <type>
    <types>DocumentRef.PurchaseInvoice</types>
   </type>
  </attributes>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.ItemKeys</types>
   </type>
  </attributes>
  <attributes>
   <name>Store</name>
   <type>
    <types>CatalogRef.Stores</types>
   </type>
  </attributes>
  <attributes>
   <name>Currency</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>TaxAmount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>RevenueType</name>
   <type>
    <types>CatalogRef.ExpenseAndRevenueTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>ProfitLossCenter</name>
   <type>
    <types>CatalogRef.BusinessUnits</types>
   </type>
  </attributes>
  <attributes>
   <name>SerialLotNumber</name>
   <type>
    <types>CatalogRef.SerialLotNumbers</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/AccumulationRegisters/R6080T_OtherPeriodsRevenues/R6080T_OtherPeriodsRevenues.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R6080T_OtherPeriodsRevenues</name>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>AmountTax</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>RowID</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Basis</name>
  <type>
   <types>DocumentRef.RevenueAccruals</types>
   <types>DocumentRef.SalesInvoice</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>TransactionCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>OtherPeriodRevenueType</name>
  <type>
   <types>EnumRef.OtherPeriodRevenueType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>RevenueType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/InformationRegisters/T6020S_BatchKeysInfo/T6020S_BatchKeysInfo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>T6020S_BatchKeysInfo</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.typeQuantity</types>
    </type>
  </resources>
  <resources>
    <name>InvoiceAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>InvoiceTaxAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>IndirectCostAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>IndirectCostTaxAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>ExtraCostAmountByRatio</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>ExtraCostTaxAmountByRatio</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>ExtraDirectCostAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>ExtraDirectCostTaxAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>AllocatedCostAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>AllocatedCostTaxAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>AllocatedRevenueAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>AllocatedRevenueTaxAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>PreliminaryQuantity</name>
    <type>
      <types>DefinedType.typeQuantity</types>
    </type>
  </resources>
  <resources>
    <name>PreliminaryAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>PreliminaryTaxAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Branch</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Store</name>
    <type>
      <types>CatalogRef.Stores</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ItemKey</name>
    <type>
      <types>CatalogRef.ItemKeys</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Direction</name>
    <type>
      <types>EnumRef.BatchDirection</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CurrencyMovementType</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BatchDocument</name>
    <type>
      <types>DocumentRef.PurchaseInvoice</types>
      <types>DocumentRef.PurchaseReturn</types>
      <types>DocumentRef.Unbundling</types>
      <types>DocumentRef.OpeningEntry</types>
      <types>DocumentRef.RetailReturnReceipt</types>
      <types>DocumentRef.SalesReturn</types>
      <types>DocumentRef.StockAdjustmentAsSurplus</types>
      <types>DocumentRef.StockAdjustmentAsWriteOff</types>
      <types>DocumentRef.Bundling</types>
      <types>DocumentRef.RetailSalesReceipt</types>
      <types>DocumentRef.Production</types>
      <types>DocumentRef.ItemStockAdjustment</types>
      <types>DocumentRef.InventoryTransfer</types>
      <types>DocumentRef.SalesInvoice</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SalesInvoice</name>
    <type>
      <types>DocumentRef.RetailSalesReceipt</types>
      <types>DocumentRef.SalesInvoice</types>
    </type>
  </dimensions>
  <dimensions>
    <name>RowID</name>
    <type>
      <types>DefinedType.typeRowID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ProfitLossCenter</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ExpenseType</name>
    <type>
      <types>CatalogRef.ExpenseAndRevenueTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Work</name>
    <type>
      <types>CatalogRef.ItemKeys</types>
    </type>
  </dimensions>
  <dimensions>
    <name>WorkSheet</name>
    <type>
      <types>DocumentRef.WorkSheet</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DELETE_BatchConsignor</name>
    <type>
      <types>DocumentRef.PurchaseInvoice</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SerialLotNumber</name>
    <type>
      <types>CatalogRef.SerialLotNumbers</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SourceOfOrigin</name>
    <type>
      <types>CatalogRef.SourceOfOrigins</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ProductionDocument</name>
    <type>
      <types>DocumentRef.Production</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PurchaseInvoiceDocument</name>
    <type>
      <types>DocumentRef.PurchaseInvoice</types>
    </type>
  </dimensions>
  <dimensions>
    <name>FixedAsset</name>
    <type>
      <types>CatalogRef.FixedAssets</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/Enums/AllocationMode/AllocationMode.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>AllocationMode</name>
 <enumValues>
  <name>ByDocuments</name>
 </enumValues>
 <enumValues>
  <name>ByRows</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/BatchDirection/BatchDirection.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>BatchDirection</name>
 <enumValues>
  <name>Receipt</name>
 </enumValues>
 <enumValues>
  <name>Expense</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/AllocationMethod/AllocationMethod.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>AllocationMethod</name>
 <enumValues>
  <name>ByQuantity</name>
 </enumValues>
 <enumValues>
  <name>ByAmount</name>
 </enumValues>
 <enumValues>
  <name>ByWeight</name>
 </enumValues>
</mdclass:Enum>

IRP/src/ChartsOfCharacteristicTypes/CurrencyMovementType/CurrencyMovementType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
 <name>CurrencyMovementType</name>
 <type>
  <types>EnumRef.CurrencyType</types>
 </type>
 <predefined>
  <items>
   <name>SettlementCurrency</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
  <items>
   <name>Default_PartnerTerm</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
  <items>
   <name>Default_Legal</name>
   <type>
    <types>EnumRef.CurrencyType</types>
   </type>
  </items>
 </predefined>
 <attributes>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>Source</name>
  <type>
   <types>CatalogRef.IntegrationSettings</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.CurrencyType</types>
  </type>
 </attributes>
 <attributes>
  <name>DeferredCalculation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>NotPostIfRateNotSet</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>EverydayRates</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
</mdclass:ChartOfCharacteristicTypes>

IRP/src/Documents/AdditionalRevenueAllocation/ObjectModule.bsl
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If DataExchange.Load Then
		Return;
	EndIf;
	If Not Cancel And WriteMode = DocumentWriteMode.Posting Then
		If ThisObject.AllocationMode = Enums.AllocationMode.ByDocuments Then
			UpdateAmounts();
			FillTables_ByDocuments();
		EndIf;
	EndIf;
EndProcedure

Procedure UpdateAmounts()
	Query = New Query();
	Query.Text = 
	"SELECT
	|	R6080T_OtherPeriodsRevenues.Basis AS Document,
	|	R6080T_OtherPeriodsRevenues.Company,
	|	R6080T_OtherPeriodsRevenues.Currency,
	|	SUM(R6080T_OtherPeriodsRevenues.AmountBalance) AS Amount,
	|	SUM(R6080T_OtherPeriodsRevenues.AmountTaxBalance) AS TaxAmount
	|FROM
	|	AccumulationRegister.R6080T_OtherPeriodsRevenues.Balance(&BalancePeriod, CurrencyMovementType = &CurrencyMovementType
	|	AND Basis IN (&ArrayOfDocuments)) AS R6080T_OtherPeriodsRevenues
	|GROUP BY
	|	R6080T_OtherPeriodsRevenues.Basis,
	|	R6080T_OtherPeriodsRevenues.Company,
	|	R6080T_OtherPeriodsRevenues.Currency";	
	Query.SetParameter("CurrencyMovementType", ChartsOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency);
	BalancePeriod = New Boundary(ThisObject.PointInTime(), BoundaryType.Excluding);
	Query.SetParameter("BalancePeriod", BalancePeriod);
	
	ArrayOfDocuments = New Array();
	For Each Row In ThisObject.RevenueDocuments Do
		ArrayOfDocuments.Add(Row.Document);
	EndDo;
	
	Query.SetParameter("ArrayOfDocuments", ArrayOfDocuments);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	
	For Each Row In ThisObject.RevenueDocuments Do
		If QuerySelection.FindNext(New Structure("Document", Row.Document)) Then
			Row.Currency = QuerySelection.Currency;
			Row.Amount = QuerySelection.Amount;
			Row.TaxAmount = QuerySelection.TaxAmount;
		EndIf;
		QuerySelection.Reset();
	EndDo;
EndProcedure

Procedure FillTables_ByDocuments()
	ThisObject.RevenueList.Clear();
	ThisObject.AllocationList.Clear();
	
	Query = New Query();
	Query.Text = 
	"SELECT
	|	RevenueDocuments.Key,
	|	RevenueDocuments.Document,
	|	RevenueDocuments.Currency
	|INTO RevenueDocuments
	|FROM
	|	&RevenueDocuments AS RevenueDocuments
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	AllocationDocuments.Key,
	|	AllocationDocuments.Document
	|INTO AllocationDocuments
	|FROM
	|	&AllocationDocuments AS AllocationDocuments
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	RevenueDocuments.Key,
	|	R6080T_OtherPeriodsRevenuesBalance.RowID,
	|	RevenueDocuments.Document AS Basis,
	|	RevenueDocuments.Currency,
	|	R6080T_OtherPeriodsRevenuesBalance.ItemKey,
	|	R6080T_OtherPeriodsRevenuesBalance.AmountBalance AS Amount,
	|	R6080T_OtherPeriodsRevenuesBalance.AmountTaxBalance AS TaxAmount
	|FROM
	|	RevenueDocuments AS RevenueDocuments
	|		LEFT JOIN AccumulationRegister.R6080T_OtherPeriodsRevenues.Balance(&BalancePeriod, (Basis, Currency) IN
	|			(SELECT
	|				RevenueDocuments.Document,
	|				RevenueDocuments.Currency
	|			FROM
	|				RevenueDocuments AS RevenueDocuments)) AS R6080T_OtherPeriodsRevenuesBalance
	|		ON RevenueDocuments.Document = R6080T_OtherPeriodsRevenuesBalance.Basis
	|		AND RevenueDocuments.Currency = R6080T_OtherPeriodsRevenuesBalance.Currency
	|		AND R6080T_OtherPeriodsRevenuesBalance.CurrencyMovementType = &CurrencyMovementType
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	AllocationDocuments.Key,
	|	T6020S_BatchKeysInfo.RowID,
	|	T6020S_BatchKeysInfo.Recorder AS Document,
	|	T6020S_BatchKeysInfo.Currency,
	|	T6020S_BatchKeysInfo.Store,
	|	T6020S_BatchKeysInfo.ItemKey,
	|	CASE
	|		WHEN T6020S_BatchKeysInfo.ItemKey.Weight <> 0
	|			THEN T6020S_BatchKeysInfo.ItemKey.Weight
	|		ELSE T6020S_BatchKeysInfo.ItemKey.Item.Weight
	|	END AS Weight,
	|	T6020S_BatchKeysInfo.Quantity,
	|	T6020S_BatchKeysInfo.Amount
	|FROM
	|	InformationRegister.T6020S_BatchKeysInfo AS T6020S_BatchKeysInfo
	|		INNER JOIN AllocationDocuments AS AllocationDocuments
	|		ON AllocationDocuments.Document = T6020S_BatchKeysInfo.Recorder
	|		AND T6020S_BatchKeysInfo.Direction = VALUE(Enum.BatchDirection.Receipt)
	|		AND T6020S_BatchKeysInfo.RowID <> """"";
	
	Query.SetParameter("RevenueDocuments"     , ThisObject.RevenueDocuments.Unload());
	Query.SetParameter("AllocationDocuments"  , ThisObject.AllocationDocuments.Unload());
	Query.SetParameter("CurrencyMovementType" , ChartsOfCharacteristicTypes.CurrencyMovementType.SettlementCurrency);
	BalancePeriod = Undefined;
	If ValueIsFilled(ThisObject.Ref) And ThisObject.Ref.Posted Then
		BalancePeriod = New Boundary(ThisObject.Ref.PointInTime(), BoundaryType.Excluding);
	Else
		BalancePeriod = ThisObject.Date;
	EndIf;
	Query.SetParameter("BalancePeriod", BalancePeriod);
	
	ThisObject.RevenueList.Clear();
	ThisObject.AllocationList.Clear();
	
	QueryResults = Query.ExecuteBatch();
	
	RevenueTable = QueryResults[2].Unload();
	AllocationTable = QueryResults[3].Unload();
	
	Total = 0;
	ColumnName = "";
	If ThisObject.AllocationMethod = Enums.AllocationMethod.ByAmount Then
		ColumnName = "Amount";
	ElsIf ThisObject.AllocationMethod = Enums.AllocationMethod.ByQuantity Then
		ColumnName = "Quantity";
	ElsIf ThisObject.AllocationMethod = Enums.AllocationMethod.ByWeight Then
		ColumnName = "Weight";
	EndIf;
		
	For Each RowRevenue In RevenueTable Do
		FillPropertyValues(ThisObject.RevenueList.Add(), RowRevenue);
		
		TotalAllocated    = 0;
		TotalAllocatedTax = 0;
		
		MaxRow    = Undefined;
		MaxRowTax = Undefined;
		
		AllocationTableCopy = AllocationTable.Copy(New Structure("Key", RowRevenue.Key));
		
		For Each RowAllocation In AllocationTableCopy Do
			Total = AllocationTableCopy.Total(ColumnName);
	
			If Total = 0 Then
				Continue;
			EndIf;
	
			NewRowAllocationList = ThisObject.AllocationList.Add();
			FillPropertyValues(NewRowAllocationList, RowAllocation);
			NewRowAllocationList.BasisRowID = RowRevenue.RowID;
			
			NewRowAllocationList.Amount    = (RowRevenue.Amount    / Total) * RowAllocation[ColumnName];
			NewRowAllocationList.TaxAmount = (RowRevenue.TaxAmount / Total) * RowAllocation[ColumnName];
			
			TotalAllocated    = TotalAllocated    + NewRowAllocationList.Amount;
			TotalAllocatedTax = TotalAllocatedTax + NewRowAllocationList.TaxAmount;
			
			If MaxRow = Undefined Then
				MaxRow = NewRowAllocationList;
			Else
				If MaxRow.Amount < NewRowAllocationList.Amount Then
					MaxRow = NewRowAllocationList;
				EndIf;
			EndIf;
			
			If MaxRowTax = Undefined Then
				MaxRowTax = NewRowAllocationList;
			Else
				If MaxRowTax.Amount < NewRowAllocationList.TaxAmount Then
					MaxRowTax = NewRowAllocationList;
				EndIf;
			EndIf;
			
		EndDo;
		
		If RowRevenue.Amount <> TotalAllocated And MaxRow <> Undefined Then
			MaxRow.Amount = MaxRow.Amount + (RowRevenue.Amount - TotalAllocated);
		EndIf;
		
		If RowRevenue.TaxAmount <> TotalAllocatedTax And MaxRowTax <> Undefined Then
			MaxRowTax.TaxAmount = MaxRowTax.TaxAmount + (RowRevenue.TaxAmount - TotalAllocatedTax);
		EndIf;
		
	EndDo;
	
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;	
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	If FillingData = Undefined Then
		ThisObject.AllocationMode = Enums.AllocationMode.ByRows;
	EndIf;
EndProcedure

Procedure Posting(Cancel, PostingMode)
	PostingServer.Post(ThisObject, Cancel, PostingMode, ThisObject.AdditionalProperties);
EndProcedure

Procedure UndoPosting(Cancel)
	UndopostingServer.Undopost(ThisObject, Cancel, ThisObject.AdditionalProperties);
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	If ThisObject.AllocationMode = Enums.AllocationMode.ByDocuments Then
		
		For Each Row In ThisObject.RevenueDocuments Do
			ArrayOfAllocationDocuments = ThisObject.AllocationDocuments.FindRows(New Structure("Key", Row.Key));
			If Not ArrayOfAllocationDocuments.Count() Then
				CommonFunctionsClientServer.ShowUsersMessage(
						StrTemplate(R().Error_125, Row.Document), 
						"Object.RevenueDocuments[" + (Row.LineNumber - 1) + "].Document", 
						"Object.RevenueDocuments");
				Cancel = True;
			EndIf;
		EndDo;
		
	EndIf;
EndProcedure
